In [120]:
import pandas as pd

In [121]:
df = pd.read_csv('../data/smhi_temp_data_save.csv', usecols=[0, 1, 2, 3], header=6, sep=';')

In [122]:
df

             Datum Tid (UTC)  Lufttemperatur Kvalitet
0       1944-01-01  07:00:00             1.6        G
1       1944-01-01  13:00:00             3.8        G
2       1944-01-01  18:00:00             4.2        G
3       1944-01-02  07:00:00             0.6        G
4       1944-01-02  13:00:00             3.8        G
...            ...       ...             ...      ...
435387  2006-12-05  09:00:00             9.4        G
435388  2006-12-05  10:00:00            10.1        Y
435389  2006-12-05  11:00:00            10.8        Y
435390  2006-12-05  12:00:00            10.9        G
435391  2006-12-05  13:00:00            10.8        Y

[435392 rows x 4 columns]

In [123]:
df['Snittemperatur'] = df.groupby('Datum')['Lufttemperatur'].transform('mean').round(2)

In [124]:
df = df.groupby('Datum').max().drop('Lufttemperatur', axis=1).reset_index()

In [125]:
df

            Datum Tid (UTC) Kvalitet  Snittemperatur
0      1944-01-01  18:00:00        G            3.20
1      1944-01-02  18:00:00        G            3.60
2      1944-01-03  18:00:00        G            2.80
3      1944-01-04  18:00:00        G           -4.47
4      1944-01-05  18:00:00        G           -1.40
...           ...       ...      ...             ...
22980  2006-12-01  23:00:00        Y            8.03
22981  2006-12-02  23:00:00        Y            8.81
22982  2006-12-03  23:00:00        Y            8.11
22983  2006-12-04  23:00:00        Y            8.57
22984  2006-12-05  13:00:00        Y            9.22

[22985 rows x 4 columns]

In [126]:
num_rows = df.count(axis=0)[0]

C:\Users\olofs\AppData\Local\Temp\ipykernel_11632\83482794.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  num_rows = df.count(axis=0)[0]

In [127]:
num_rows

22985

In [128]:
df.dtypes

Datum              object
Tid (UTC)          object
Kvalitet           object
Snittemperatur    float64
dtype: object

In [129]:
df['Year'] = df['Datum'].str.split('-').str[0]

In [130]:
df

            Datum Tid (UTC) Kvalitet  Snittemperatur  Year
0      1944-01-01  18:00:00        G            3.20  1944
1      1944-01-02  18:00:00        G            3.60  1944
2      1944-01-03  18:00:00        G            2.80  1944
3      1944-01-04  18:00:00        G           -4.47  1944
4      1944-01-05  18:00:00        G           -1.40  1944
...           ...       ...      ...             ...   ...
22980  2006-12-01  23:00:00        Y            8.03  2006
22981  2006-12-02  23:00:00        Y            8.81  2006
22982  2006-12-03  23:00:00        Y            8.11  2006
22983  2006-12-04  23:00:00        Y            8.57  2006
22984  2006-12-05  13:00:00        Y            9.22  2006

[22985 rows x 5 columns]

In [131]:
df['Year'].value_counts().sort_values(ascending=False)

Year
1944    366
1972    366
2000    366
1968    366
2004    366
       ...
2005    365
1981    365
1975    365
1979    365
2006    339
Name: count, Length: 63, dtype: int64

In [132]:
years = []
for ind, row in df.iterrows():
    year = row['Year']
    if year not in years:
        years.append(year)
    else:
        pass

In [133]:
years

['1944',
 '1945',
 '1946',
 '1947',
 '1948',
 '1949',
 '1950',
 '1951',
 '1952',
 '1953',
 '1954',
 '1955',
 '1956',
 '1957',
 '1958',
 '1959',
 '1960',
 '1961',
 '1962',
 '1963',
 '1964',
 '1965',
 '1966',
 '1967',
 '1968',
 '1969',
 '1970',
 '1971',
 '1972',
 '1973',
 '1974',
 '1975',
 '1976',
 '1977',
 '1978',
 '1979',
 '1980',
 '1981',
 '1982',
 '1983',
 '1984',
 '1985',
 '1986',
 '1987',
 '1988',
 '1989',
 '1990',
 '1991',
 '1992',
 '1993',
 '1994',
 '1995',
 '1996',
 '1997',
 '1998',
 '1999',
 '2000',
 '2001',
 '2002',
 '2003',
 '2004',
 '2005',
 '2006']

In [134]:
df['Year'] = pd.to_numeric(df['Year'], downcast='integer')

In [135]:
df.dtypes

Datum              object
Tid (UTC)          object
Kvalitet           object
Snittemperatur    float64
Year                int16
dtype: object

In [136]:
df

            Datum Tid (UTC) Kvalitet  Snittemperatur  Year
0      1944-01-01  18:00:00        G            3.20  1944
1      1944-01-02  18:00:00        G            3.60  1944
2      1944-01-03  18:00:00        G            2.80  1944
3      1944-01-04  18:00:00        G           -4.47  1944
4      1944-01-05  18:00:00        G           -1.40  1944
...           ...       ...      ...             ...   ...
22980  2006-12-01  23:00:00        Y            8.03  2006
22981  2006-12-02  23:00:00        Y            8.81  2006
22982  2006-12-03  23:00:00        Y            8.11  2006
22983  2006-12-04  23:00:00        Y            8.57  2006
22984  2006-12-05  13:00:00        Y            9.22  2006

[22985 rows x 5 columns]

In [137]:
df_from_1976 = df.where(df['Year'] > 1975).dropna()

In [140]:
df_from_1976['Year'] = pd.to_numeric(df_from_1976['Year'], downcast='integer')

In [144]:
df_1976_to_1996 = df_from_1976.where(df['Year'] < 1996).dropna()

In [145]:
df_1976_to_1996

            Datum Tid (UTC) Kvalitet  Snittemperatur    Year
11688  1976-01-01  23:00:00        Y            1.32  1976.0
11689  1976-01-02  23:00:00        Y           -3.12  1976.0
11690  1976-01-03  23:00:00        Y           -0.97  1976.0
11691  1976-01-04  23:00:00        Y           -5.14  1976.0
11692  1976-01-05  23:00:00        Y           -1.74  1976.0
...           ...       ...      ...             ...     ...
18988  1995-12-27  21:00:00        G           -8.16  1995.0
18989  1995-12-28  21:00:00        G           -5.41  1995.0
18990  1995-12-29  21:00:00        G           -2.70  1995.0
18991  1995-12-30  21:00:00        G           -2.28  1995.0
18992  1995-12-31  21:00:00        G           -9.24  1995.0

[7305 rows x 5 columns]

In [146]:
df_1976_to_1996.to_csv('../data/avg_temp_from_save_1976_to_1995_incl.csv')